# <b>A. <span style='color:#0B2F9F'><code>PREFIX</code></span></b>
Prefix merupakan penggunaan awalan pada nama tabel untuk memberikan informasi tambahan atau untuk mengelompokkan objek-objek tertentu. Sebagai contoh perhatikan gambar berikut : <br><br>

<img src="https://raw.githubusercontent.com/bachtiyarma/Material/refs/heads/main/Image/Materi-SQL/SQL%20-%20Prefix.png" width="50%">

<br><br>
Nama tabel dimisalkan (diberi alias) sebagai tbl, lalu untuk mengakses kolom pada tabel tersebut bisa diberi prefix tbl.kolom1 dan seterusnya

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_demography, ambil kolom customer_id, gender, age dan married namun gunakan alias 'cdm' pada nama tabel dan sematkan prefixnya saat mengakses kolom!</b></i>

In [ ]:
select cdm.customer_id, cdm.gender, cdm.age, cdm.married from telco_churn.customer_demography as cdm

# <b>B. <span style='color:#0B2F9F'><code>JOIN</code></span></b>

Data biasanya disimpan di berbagai tabel atau sistem yang berbeda pada RDBMS (Relational Database Management System). JOIN memungkinkan pengguna untuk menggabungkan data dari berbagai sumber untuk mendapatkan gambaran yang lebih lengkap. Memahami query JOIN memungkinkan seorang pengguna untuk mengintegrasikan dan menganalisis data secara efektif, sehingga dapat meningkatkan kualitas analisis dan mendukung pengambilan keputusan berbasis data.

Operasi JOIN standar dapat dilakukan jika terdapat kunci pada tiap tabel yang saling terhubung. Operasi join dasar yang paling umum digunakan ada 4 yakni :
<ul>
    <li><b>LEFT JOIN</b></li>
    LEFT JOIN adalah jenis operasi penggabungan baris dari dua tabel, tetapi hanya mengembalikan semua baris dari tabel kiri (tabel pertama) dan baris yang cocok dari tabel kanan (tabel kedua). Jika tidak ada kecocokan di tabel kanan, maka nilai-nilai untuk kolom dari tabel kanan akan diisi dengan NULL.<br><br>
    <img src="https://thomasadventure.blog/img/left-join-extra.gif" width="20%">
    <br><br>
    <li><b>RIGHT JOIN</b></li>
    RIGHT JOIN adalah jenis operasi penggabungan baris dari dua tabel, tetapi hanya mengembalikan semua baris dari tabel kanan (tabel kedua) dan baris yang cocok dari tabel kiri (tabel pertama). Jika tidak ada kecocokan di tabel kiri, maka nilai-nilai untuk kolom dari tabel kiri akan diisi dengan NULL.<br><br>
    <img src="https://thomasadventure.blog/img/right-join.gif" width="20%">
    <br><br>
    <li><b>INNER JOIN</b></li>
    INNER JOIN adalah jenis operasi penggabungan yang hanya mengembalikan baris yang memiliki kecocokan di kedua tabel berdasarkan kriteria tertentu.<br><br>
    <img src="https://thomasadventure.blog/img/inner-join.gif" width="20%">
    <br><br>
     <li><b>FULL JOIN</b></li>
    FULL JOIN adalah jenis operasi penggabungan semua baris dari kedua tabel, baik yang memiliki kecocokan maupun yang tidak. Dengan demikian, hasilnya akan mencakup semua data dari tabel kiri dan tabel kanan.<br><br>
    <img src="https://thomasadventure.blog/img/full-join.gif" width="20%">
    <br><br>
</ul>

#### <i><b><span style='color:#55679C'>Pre-Quest</span>
Untuk melakukan join biasanya akan lebih mudah jika arsitektur relasi antar tabel atau biasa dikenal ERD (Entity Relational Diagram) telah dibuat atau diketahui. Pada data telco churn ERD-nya disajikan pada gambar berikut<br><br>

<img src="https://raw.githubusercontent.com/bachtiyarma/Material/refs/heads/main/Image/Materi-SQL/ERD%20-%20Telco%20Churn.png" width="40%">

#### <i><b><span style='color:#55679C'>Quest : </span>Hitung berapa rata-rata biaya bulanan tiap status customer! Tampilkan status, total_customer, avg_monthly_charge! Interpretasikan insight dari hasil perhitungan!

In [ ]:
select
  sts.status,
  count (sts.customer_id) as total_customer,
  avg(srv.monthly_charge) as avg_monthly_charge
from telco_churn.customer_status as sts
inner join telco_churn.telco_services as srv on sts.customer_id = srv.customer_id
group by sts.status

<b><span style='color:#FFDB00'><i>Interpretasi Hasil : </i></span></b><br>
- Sebanyak 1869 konsumen sudah berstatus churned atau dapat disebut konsumen tersebut telah tidak berlangganan lagi dengan rata-rata tagihan per bulannya sebesar 74.4 dolar.
- Sebanyak 4720 konsumen masih berstatus berlangganan dengan rata-rata tagihan per bulannya sebesar 62.9 dolar.
- Sebanyak 454 konsumen berstatus Joined atau dapat disebut konsumen tersebut baru berlangganan dengan rata-rata tagihan per bulannya sebesar 43.4 dollar.
- Dari tabel di atas, konsumen dengan tagihan per bulan yang tinggi cenderung memilih untuk berhenti berlangganan, yang menunjukkan bahwa nominal 74.4 sudah terbilang tinggi bagi konsumen.
- Konsumen dengan tagihan per bulan di angka 62.9 dolar masih memilih untuk bertahan untuk berlangganan layanan, begitupun dengan konsumen baru yang memiliki tagihan sebesar 43.4 dolar.

#### <i><b><span style='color:#55679C'>Quest : </span>Coba Sudut Pandang Lebih Luas; Hitung berapa banyak customer, rata-rata biaya bulanan & rata-rata umur tiap status customer, gender dan status pernikahannya! Tampilkan status, gender, married, total_customer, avg_monthly_charge! Urutkan hasilnya per metrik perhitungan dan Interpretasikan insight dari hasil perhitungan!

In [ ]:
-- Quest : Coba Sudut Pandang Lebih Luas; Hitung berapa banyak customer, rata-rata biaya bulanan & rata-rata umur tiap status customer, gender dan status pernikahannya! Tampilkan status, gender, married, total_customer, avg_monthly_charge! Urutkan hasilnya per metrik perhitungan!
select
  sts.status,
  cdm.gender,
  cdm.married,
  count (sts.customer_id) as total_customer,
  avg(cdm.age) as average_age,
  avg(srv.monthly_charge) as avg_monthly_charge
from telco_churn.customer_status as sts
inner join telco_churn.telco_services as srv on sts.customer_id = srv.customer_id
inner join telco_churn.customer_demography as cdm on sts.customer_id = cdm.customer_id
GROUP BY sts.status, cdm.gender, cdm.married
ORDER BY total_customer DESC, avg_monthly_charge DESC

<b><span style='color:#FFDB00'><i>Interpretasi Hasil : </i></span></b><br>
- Konsumen dengan status stayed atau masih berlangganan memiliki total konsumen terbanyak yaitu di angka 1326, 1323, 1056 , dan 1015. Keempatnya memikiki tagihan bulanan di rentang 58-66 dolar.
- Konsumen dengan status churned atau sudah berhenti berlangganan memiliki total konsumen yang cukup banyak yaitu di angka 620, 580, 350, dan 319. Keempatnya memiliki tagihan bulanan di rentang 69-81 dolar.
- Konsumen dengan status joined atau baru berlangganan memiliki total konsumen yang sedikit yaitu di angka 205, 165, 46 dan 38. Keempatnya memiliki tagihan bulanan di rentang 42-48 dolar.
- Jumlah konsumen terbanyak didapati dari konsumen yang sudah menikah dari kalangan pria, dan disusul oleh konsumen yang sudah menikah dari kalangan wanita. Keduanya memiliki tagihan yang tidak terlalu tinggi, yaitu di angka 66 dan 64. Namun, angka tersebut masih lebih tinggi dari urutan ke tiga dan ke empat dari jumlah konsumen terbanyak yaitu pria dan wanita yang belum menikah. Ini menunjukkan bahwa pria dan wanita yang sudah menikah cenderung lebih sering menggunakan layanan tersebut.
- Konsumen yang sudah tidak berlangganan memiliki rata-rata tagihan yang tinggi.

#### <i><b><span style='color:#55679C'>Quest : </span>Bagaimana dengan total tenure ? Hitung berapa rata-rata tenure_in_month tiap status customer! Tampilkan status, total_customer, avg_tenure_in_month! Interpretasikan insight dari hasil perhitungan!

In [ ]:
select
  sts.status,
  count (sts.customer_id) as total_customer,
  avg(srv.tenure_in_months) as avg_tenure_in_month
from telco_churn.customer_status as sts
inner join telco_churn.telco_services as srv on sts.customer_id = srv.customer_id
GROUP BY sts.status

<b><span style='color:#FFDB00'><i>Interpretasi Hasil : </i></span></b><br>
- Konsumen yang masih berlangganan memiliki jumlah konsumen yang paling tinggi dengan rata-rata lama penggunaannya yaitu selama 41 bulan.
- Konsumen yang sudah tidak berlangganan memiliki jumlah konsumen yang cukup banyak dengan rata-rata lama penggunaannya yaitu selama 17.9 bulan.
- Konsumen yang baru berlangganan memiliiki jumlah konsumen yang paling sedikit dengan rata-rata lama penggunaannya yaitu selama 1.7 bulan.

#### <i><b><span style='color:#55679C'>Quest : </span>Perusahaan telekomunikasi ingin melakukan perluasan market ke beberapa daerah yang mana di daerah tersebut belum ada pelanggan terdaftar dalam database. Buatkan daftar kode pos pada tabel population yang sama sekali belum ada orang yang menggunakan layanan telekomunikasi! Tampilkan kode pos dan jumlah populasinya!

In [ ]:
SELECT
  ppl.zip_code,
  ppl.population,
  COUNT(cl.customer_id) AS total_customer
FROM telco_churn.customer_location AS cl
RIGHT JOIN telco_churn.population AS ppl
  ON cl.zip_code = ppl.zip_code
GROUP BY zip_code, ppl.population
HAVING COUNT(cl.customer_id) = 0
ORDER BY ppl.population DESC;

<b><span style='color:#FFDB00'><i>Interpretasi Hasil : </i></span></b><br>
- Zip code dengan populasi terbesar adalah 91402 dengan 66.249 orang, sedangkan populasi terkecil adalah di zip code 91743 dengan 13 orang.